In [1]:
import pandas as pd

In [2]:
k=pd.DataFrame({'Name':["Ranga","alekhya","gireesha","Ramu","Siva"],"Salary":[23000,25000,26000,21000,30000],"Desig":['MSTP','FDP','MSTP','PH','DEV'],"Job Location":['Ongole','Tpt','Bhm','Ong','Task']})

k

       Name  Salary Desig Job Location
0     Ranga   23000  MSTP       Ongole
1   alekhya   25000   FDP          Tpt
2  gireesha   26000  MSTP          Bhm
3      Ramu   21000    PH          Ong
4      Siva   30000   DEV         Task

In [4]:
k.iloc[2]

Name            gireesha
Salary             26000
Desig               MSTP
Job Location         Bhm
Name: 2, dtype: object

In [5]:
k['Salary']

0    23000
1    25000
2    26000
3    21000
4    30000
Name: Salary, dtype: int64

In [7]:
k['Desig']

0    MSTP
1     FDP
2    MSTP
3      PH
4     DEV
Name: Desig, dtype: object

In [11]:
k['Desig']

0    MSTP
1     FDP
2    MSTP
3      PH
4     DEV
Name: Desig, dtype: object

In [12]:
k.Name

0       Ranga
1     alekhya
2    gireesha
3        Ramu
4        Siva
Name: Name, dtype: object

In [13]:
k.loc[1][2]

'FDP'

In [16]:
k.loc[4][2]

'DEV'

In [21]:
k.iloc[2]

Name            gireesha
Salary             26000
Desig               MSTP
Job Location         Bhm
Name: 2, dtype: object

In [22]:
k['Name']

0       Ranga
1     alekhya
2    gireesha
3        Ramu
4        Siva
Name: Name, dtype: object

In [23]:
k['Name'][1]

'alekhya'

In [24]:
k.isnull()

    Name  Salary  Desig  Job Location
0  False   False  False         False
1  False   False  False         False
2  False   False  False         False
3  False   False  False         False
4  False   False  False         False

In [27]:
k[k.isnull()]

  Name  Salary Desig Job Location
0  NaN     NaN   NaN          NaN
1  NaN     NaN   NaN          NaN
2  NaN     NaN   NaN          NaN
3  NaN     NaN   NaN          NaN
4  NaN     NaN   NaN          NaN

In [29]:
k["Salary"].values

array([23000, 25000, 26000, 21000, 30000], dtype=int64)

In [30]:
k.index

RangeIndex(start=0, stop=5, step=1)

In [31]:
k.values

array([['Ranga', 23000, 'MSTP', 'Ongole'],
       ['alekhya', 25000, 'FDP', 'Tpt'],
       ['gireesha', 26000, 'MSTP', 'Bhm'],
       ['Ramu', 21000, 'PH', 'Ong'],
       ['Siva', 30000, 'DEV', 'Task']], dtype=object)

In [32]:
k.columns

Index(['Name', 'Salary', 'Desig', 'Job Location'], dtype='object')

In [33]:
k.index

RangeIndex(start=0, stop=5, step=1)

In [37]:
k.replace('PH',"Python")

       Name  Salary   Desig Job Location
0     Ranga   23000    MSTP       Ongole
1   alekhya   25000     FDP          Tpt
2  gireesha   26000    MSTP          Bhm
3      Ramu   21000  Python          Ong
4      Siva   30000     DEV         Task

In [38]:
k.replace("Task","East")

       Name  Salary Desig Job Location
0     Ranga   23000  MSTP       Ongole
1   alekhya   25000   FDP          Tpt
2  gireesha   26000  MSTP          Bhm
3      Ramu   21000    PH          Ong
4      Siva   30000   DEV         East

In [39]:
k.loc[2][3]

'Bhm'

In [42]:
k.size

20

In [43]:
k.shape

(5, 4)

In [45]:
k.loc[0]

Name             Ranga
Salary           23000
Desig             MSTP
Job Location    Ongole
Name: 0, dtype: object

In [46]:
k.sort_values(by="Salary")

       Name  Salary Desig Job Location
3      Ramu   21000    PH          Ong
0     Ranga   23000  MSTP       Ongole
1   alekhya   25000   FDP          Tpt
2  gireesha   26000  MSTP          Bhm
4      Siva   30000   DEV         Task

In [47]:
k.sort_index()

       Name  Salary Desig Job Location
0     Ranga   23000  MSTP       Ongole
1   alekhya   25000   FDP          Tpt
2  gireesha   26000  MSTP          Bhm
3      Ramu   21000    PH          Ong
4      Siva   30000   DEV         Task

In [48]:
k.sort_values("Desig")

       Name  Salary Desig Job Location
4      Siva   30000   DEV         Task
1   alekhya   25000   FDP          Tpt
0     Ranga   23000  MSTP       Ongole
2  gireesha   26000  MSTP          Bhm
3      Ramu   21000    PH          Ong

In [49]:
k=k.replace("PH","Python")
k

       Name  Salary   Desig Job Location
0     Ranga   23000    MSTP       Ongole
1   alekhya   25000     FDP          Tpt
2  gireesha   26000    MSTP          Bhm
3      Ramu   21000  Python          Ong
4      Siva   30000     DEV         Task

In [62]:
k=k.replace("Task","East")

k

       Name   Salary   Desig Job Location
1   alekhya  25000.0     FDP          Tpt
2  gireesha  26000.0    MSTP          Bhm
3      Ramu  21000.0  Python          Ong
4      Siva  30000.0     DEV         East
5       NaN      NaN     NaN          NaN

In [53]:
dir(pd)

['Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NaT',
 'Panel',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseArray',
 'SparseDataFrame',
 'SparseDtype',
 'SparseSeries',
 'TimeGrouper',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_hashtable',
 '_lib',
 '_libs',
 '_np_version_under1p13',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_tslib',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'datetime',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'np',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_msgpack',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [57]:
pd.Series(pd.date_range(start='12-6-2019',end='12-10-2019'))

0   2019-12-06
1   2019-12-07
2   2019-12-08
3   2019-12-09
4   2019-12-10
dtype: datetime64[ns]

In [63]:
pd.DataFrame(k,index=[1,2,3,4,5])

       Name   Salary   Desig Job Location
1   alekhya  25000.0     FDP          Tpt
2  gireesha  26000.0    MSTP          Bhm
3      Ramu  21000.0  Python          Ong
4      Siva  30000.0     DEV         East
5       NaN      NaN     NaN          NaN

In [64]:
k

       Name   Salary   Desig Job Location
1   alekhya  25000.0     FDP          Tpt
2  gireesha  26000.0    MSTP          Bhm
3      Ramu  21000.0  Python          Ong
4      Siva  30000.0     DEV         East
5       NaN      NaN     NaN          NaN

In [74]:
import numpy as np
k=k.replace(np.NaN,10)
k.loc[1]

Name            alekhya
Salary            25000
Desig               FDP
Job Location        Tpt
Name: 1, dtype: object

In [81]:
p=np.array(['Ranga','23000',"MSTP","Ongole"])
p

array(['Ranga', '23000', 'MSTP', 'Ongole'], dtype='<U6')

In [84]:
k.loc[5]=['Ranga','23000',"MSTP","Ongole"]

In [85]:
k

       Name Salary   Desig Job Location
1   alekhya  25000     FDP          Tpt
2  gireesha  26000    MSTP          Bhm
3      Ramu  21000  Python          Ong
4      Siva  30000     DEV         East
5     Ranga  23000    MSTP       Ongole

In [94]:
k=k.sort_values(by='Desig',ascending=False)

In [97]:
k.loc[5]

Name             Ranga
Salary           23000
Desig             MSTP
Job Location    Ongole
Name: 5, dtype: object

In [99]:
k['Name']

3        Ramu
2    gireesha
5       Ranga
1     alekhya
4        Siva
Name: Name, dtype: object

In [103]:
help(k.groupby)

Help on method groupby in module pandas.core.generic:

groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False, observed=False, **kwargs) method of pandas.core.frame.DataFrame instance
    Group DataFrame or Series using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, or list of labels
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If an ndarray is passed, the
        values are used as-is determine the groups. A label or list of
        labels may be passed to group by the columns in ``self``. Notice
        that a tuple is interpreted a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1).
    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels.
    as_index : bool, default True
        For aggregated output, return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output.
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group.
    group_keys : bool, default True
        When calling apply, add group keys to index to identify pieces.
    squeeze : bool, default False
        Reduce the dimensionality of the return type if possible,
        otherwise return a consistent type.
    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionadded:: 0.23.0

    **kwargs
        Optional, only accepts keyword argument 'mutated' and is passed
        to groupby.

    Returns
    -------
    DataFrameGroupBy or SeriesGroupBy
        Depends on the calling object and returns groupby object that
        contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <http://pandas.pydata.org/pandas-docs/stable/groupby.html>`_ for more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal' : ['Falcon', 'Falcon',
    ...                                'Parrot', 'Parrot'],
    ...                    'Max Speed' : [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Capitve', 'Wild', 'Capitve', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed' : [390., 350., 30., 20.]},
    ...                    index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Capitve      390.0
           Wild         350.0
    Parrot Capitve       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level=1).mean()
             Max Speed
    Type
    Capitve      210.0
    Wild         185.0

In [108]:
k['Rank']=k['Salary'].rank()

In [109]:
k

       Name Salary   Desig Job Location  Rank
3      Ramu  21000  Python          Ong   NaN
2  gireesha  26000    MSTP          Bhm   NaN
5     Ranga  23000    MSTP       Ongole   NaN
1   alekhya  25000     FDP          Tpt   NaN
4      Siva  30000     DEV         East   NaN

In [110]:
k.isnull()

    Name  Salary  Desig  Job Location  Rank
3  False   False  False         False  True
2  False   False  False         False  True
5  False   False  False         False  True
1  False   False  False         False  True
4  False   False  False         False  True

In [113]:
k.rank()

   Rank
3   NaN
2   NaN
5   NaN
1   NaN
4   NaN

In [115]:
string="HYkkl"
str.swapcase(string)

'hyKKL'

In [118]:
string = input()
print(any(c.isalnum()  for c in string))
print(any(c.isalpha() for c in string))
print(any(c.isdigit() for c in string))
print(any(c.islower() for c in string))
print(any(c.isupper() for c in string))

k5P
True
True
True
True
True